[
    {
        "time": "11:00",
        "fragments": [
            {
                "from": 1,
                "to": 6,
                "text": ">> (Phillip Roberts) hello, come in and sitdown. So for the last session before the afternoon\r"
            },
            {
                "from": 7,
                "to": 12,
                "text": "break, we have Phillip Roberts who works atAndea and is here from London ‑‑ Scotland.\r"
            },
            {
                "from": 12,
                "to": 17,
                "text": "Edinbrough.  ‑‑ wow, ten second memory,he's going to talk about the vent loop. If\r"
            },
            {
                "from": 17,
                "to": 17,
                "text": "everyone could give Phillip a big brownedderround of applause.\r"
            },
            {
                "from": 18,
                "to": 20,
                "text": ">> Phillip Roberts: Okay hello everyone, thanksfor coming to the side track, it's awesome\r"
            },
            {
                "from": 20,
                "to": 27,
                "text": "to see it packed out in here. Can everyonegive me a stretch. I needed to stretch, so\r"
            },
            {
                "from": 27,
                "to": 34,
                "text": "I look less weird. I want to talk about theevent loop and what the heck is the event\r"
            },
            {
                "from": 35,
                "to": 42,
                "text": "loop, as in the event loop inside JavaScript.So first up, as he said I work for AndYet\r"
            },
            {
                "from": 43,
                "to": 50,
                "text": "which is an awesome little Dev shop in theUS, look us up if you need help with real‑time\r"
            },
            {
                "from": 50,
                "to": 57,
                "text": "stuff. That's what we're good at. So, about18 months ago--I'm a paid professional JavaScript\r"
            },
            {
                "from": 58,
                "to": 65,
                "text": "developer--I thought to myself how does, likeJavaScript actually work? And I wasn't entirely\r"
            },
            {
                "from": 65,
                "to": 71,
                "text": "sure. I'd heard V8 as a term, chrome's Runtimedidn't really know what that meant, what that\r"
            },
            {
                "from": 71,
                "to": 75,
                "text": "did. I'd heard things like single threaded,you know obviously I'm using callbacks. How\r"
            },
            {
                "from": 76,
                "to": 82,
                "text": "do callbacks work? I started a journey oflike reading and research and experimenting\r"
            },
            {
                "from": 82,
                "to": 85,
                "text": "in the browser which basically started likethis.\r"
            },
            {
                "from": 85,
                "to": 92,
                "text": " ‑‑ I was kind of like JavaScript whatare you. I'm a single threaded single concurrent\r"
            },
            {
                "from": 93,
                "to": 99,
                "text": "language ‑‑ right. yeah, cool, I havea call stack, an event loop, a callback queue,\r"
            },
            {
                "from": 99,
                "to": 105,
                "text": "and some other APIs and stuff.  ‑‑ rite.I did not do a computer science degree. I\r"
            },
            {
                "from": 105,
                "to": 110,
                "text": "mean, these words, they're words, so I heardabout V8 and the various Runtimes and different\r"
            },
            {
                "from": 111,
                "to": 115,
                "text": "browsers so I looked to V8 do you have a callstack, an event loop, a callback queue, and\r"
            },
            {
                "from": 115,
                "to": 119,
                "text": "some other APIs and stuff, I have a call stackand a heap, I don't know what those other\r"
            },
            {
                "from": 120,
                "to": 127,
                "text": "things are, okay, interesting so basically18 months passed. And I think I get this.\r"
            },
            {
                "from": 132,
                "to": 136,
                "text": "(Laughing) and so, this is what I want toshare with you today. Hopefully this will\r"
            },
            {
                "from": 136,
                "to": 142,
                "text": "be useful if you're relatively new to JavaScript,help you understand why JavaScript is so weird\r"
            },
            {
                "from": 142,
                "to": 146,
                "text": "when you compare it to other languages youmight used why callbacks are a thing, cause\r"
            },
            {
                "from": 147,
                "to": 152,
                "text": "us hell but are required. And if you're anexperienced JavaScript developer hopefully\r"
            },
            {
                "from": 152,
                "to": 157,
                "text": "give you some fresh insights how the Runtimeyou're using works so you can think about\r"
            },
            {
                "from": 158,
                "to": 165,
                "text": "it a little better. So if we look at the JavaScriptRuntime itself like V8 which is the Runtime\r"
            },
            {
                "from": 166,
                "to": 173,
                "text": "inside Chrome. This is a simplified view ofwhat JavaScript Runtime is. The heap, where\r"
            },
            {
                "from": 177,
                "to": 183,
                "text": "memory allocation happens, and then there'sthe call stack, which is where your stack\r"
            },
            {
                "from": 184,
                "to": 191,
                "text": "frames are and all that kind of stuff, but,if you, like, clone the V8 code base and grep\r"
            },
            {
                "from": 191,
                "to": 197,
                "text": "for things like setTimeout or DOM or HTTPrequest, they're not in there, they don't\r"
            },
            {
                "from": 197,
                "to": 204,
                "text": "exist in V8, which was a surprise to me. It'sfirst thing you use when you start thinking\r"
            },
            {
                "from": 204,
                "to": 211,
                "text": "about async stuff and it's not in the V8 source.Hmm ... interesting. So, over this 18 months\r"
            },
            {
                "from": 212,
                "to": 216,
                "text": "of discovery I come to realize this is really,this is really the bigger picture, this is\r"
            },
            {
                "from": 216,
                "to": 221,
                "text": "what I'm hoping to get you on board with todayand understand what these pieces are, we have\r"
            },
            {
                "from": 221,
                "to": 225,
                "text": "the V8 Runtime but then we have these thingscalled web APIs which are extra things that\r"
            },
            {
                "from": 226,
                "to": 232,
                "text": "the browser provides. DOM, AJAX, time out,things like that, we have this mythical event\r"
            },
            {
                "from": 233,
                "to": 238,
                "text": "loop and the callback queue. I'm sure you'veheard some of these terms before, but maybe\r"
            },
            {
                "from": 238,
                "to": 243,
                "text": "you don't quite understand how these piecespull together. So, I'm going to start from\r"
            },
            {
                "from": 243,
                "to": 247,
                "text": "the beginning, some of this will be new, towords might be new to people, other people\r"
            },
            {
                "from": 247,
                "to": 253,
                "text": "will get this. We're going to quickly moveon from here, bear with me if this is obvious,\r"
            },
            {
                "from": 253,
                "to": 258,
                "text": "I think for a lot of people it's not. So,JavaScript is a single threaded programming\r"
            },
            {
                "from": 258,
                "to": 263,
                "text": "language, single threaded Runtime, it hasa single call stack. And it can do one thing\r"
            },
            {
                "from": 264,
                "to": 269,
                "text": "at a time, that's what a single thread means,the program can run one piece of code at a\r"
            },
            {
                "from": 270,
                "to": 274,
                "text": "time. So, let's try and visualize that justto get our heads around what that mean, so\r"
            },
            {
                "from": 275,
                "to": 280,
                "text": "if I have some code like this on your left,we've got a few functions, a function multiplier\r"
            },
            {
                "from": 280,
                "to": 285,
                "text": "which multiplies two numbers, square whichcalls multiply with the same number twice,\r"
            },
            {
                "from": 286,
                "to": 290,
                "text": "a function which prints the square of a numberof calling square and then calling console.log\r"
            },
            {
                "from": 290,
                "to": 295,
                "text": "and then at the bottom of our file we actuallyrun print square, this code all good? Make\r"
            },
            {
                "from": 295,
                "to": 302,
                "text": "sense? Cool. So, if we run this, well, I shouldback up a step, so the call stack is basically ‑‑\r"
            },
            {
                "from": 304,
                "to": 308,
                "text": "it's a data structure which records basicallywhere in the program we are, if we step into\r"
            },
            {
                "from": 308,
                "to": 312,
                "text": "a function, we put something on to the stack,if we return from a function, we pop off the\r"
            },
            {
                "from": 312,
                "to": 317,
                "text": "top of the stack that's all the stack cando, ‑‑ so if you run this file, there's\r"
            },
            {
                "from": 318,
                "to": 322,
                "text": "kind of a main function, right, like the fileitself, so, we push that on to the stack.\r"
            },
            {
                "from": 323,
                "to": 327,
                "text": "Then we have some function definitions, they'rejust like defining the state of the world,\r"
            },
            {
                "from": 328,
                "to": 332,
                "text": "and finally we got to print square, right,so print square is a function call, so we\r"
            },
            {
                "from": 332,
                "to": 336,
                "text": "push that on to the stack, and immediatelyinside print square, push on to the stack,\r"
            },
            {
                "from": 337,
                "to": 343,
                "text": "which calls multiply, now we have a returnstatement, we multiply A and B and we return,\r"
            },
            {
                "from": 343,
                "to": 348,
                "text": "when we return we pop something off the stack,so, pop, multiplier of the stack, returning\r"
            },
            {
                "from": 348,
                "to": 355,
                "text": "to square, return to print square, console.log,there's no return, it's implicit, because\r"
            },
            {
                "from": 357,
                "to": 361,
                "text": "we got to the end of the function, and we'redone so that's like a visualization of the\r"
            },
            {
                "from": 361,
                "to": 368,
                "text": "call stalk, does that make sense? (Yes, Phil)even if you haven't thought about the call\r"
            },
            {
                "from": 369,
                "to": 374,
                "text": "stack before, you've come across it when you'vebeen doing browser‑side development, so\r"
            },
            {
                "from": 375,
                "to": 379,
                "text": "if we have code like this, a function bazwhich calls bar, which calls Foo, which throws\r"
            },
            {
                "from": 380,
                "to": 387,
                "text": "an error if we run it in Chrome we see this.And it prints the stack trace, right, the\r"
            },
            {
                "from": 389,
                "to": 396,
                "text": "state of the stack when that error happened,so, uncaught error oops Foo, bar, Baz, anonymous\r"
            },
            {
                "from": 398,
                "to": 405,
                "text": "function, which is our main. Equally, if you'veheard the term like blowing the stack, this\r"
            },
            {
                "from": 405,
                "to": 411,
                "text": "is an example of that. Have a function foowhich calls Foo , so what's going to happen\r"
            },
            {
                "from": 411,
                "to": 418,
                "text": "? We have a function main which calls foowhich calls foo, which calls foo, which calls\r"
            },
            {
                "from": 418,
                "to": 424,
                "text": "foo, and ultimately chrome says, you probablydidn't mean to call foo 16,000 times recursively,\r"
            },
            {
                "from": 425,
                "to": 431,
                "text": "I'll just kill things for you and you canfigure out where your bug lies, right. So\r"
            },
            {
                "from": 431,
                "to": 436,
                "text": "although I may be representing a new sideof the call stack you have some sense of it\r"
            },
            {
                "from": 436,
                "to": 442,
                "text": "in your development practice already. So,the big question then comes is like what happens\r"
            },
            {
                "from": 442,
                "to": 449,
                "text": "when things are slow? So, we talk about blockingand blocking behavior and blocking, there's\r"
            },
            {
                "from": 450,
                "to": 455,
                "text": "no strict definition of what is and didn'tblocking, really it's just code that's slow.\r"
            },
            {
                "from": 455,
                "to": 460,
                "text": "So console.log isn't slow, doing a while loopfrom one to ten billion is slow, network requests\r"
            },
            {
                "from": 461,
                "to": 468,
                "text": "are slow. Image requests are slow. Thingswhich are slow and on that stack are what\r"
            },
            {
                "from": 469,
                "to": 476,
                "text": "are blocking means. So heres a little example,so let's say we have, this is like a fake\r"
            },
            {
                "from": 477,
                "to": 484,
                "text": "bit of code, getSynchronous, right, like jQueryis like, AJAX request. What would happen if\r"
            },
            {
                "from": 484,
                "to": 489,
                "text": "those were synchronous requests, forget whatwe know about async callbacks they're synchronous.\r"
            },
            {
                "from": 490,
                "to": 496,
                "text": "If we go through it like we have, we callgetSync and then we wait, because then we're\r"
            },
            {
                "from": 496,
                "to": 501,
                "text": "doing network request, network is relativeto computers, are slow, hopefully that network\r"
            },
            {
                "from": 501,
                "to": 508,
                "text": "requests completes, we can move on, wait,move on. Wait, and, I mean, this network request\r"
            },
            {
                "from": 512,
                "to": 518,
                "text": "might never finish, so ... yeah, I guess I'llgo home. Finally those three, you know blocking\r"
            },
            {
                "from": 519,
                "to": 525,
                "text": "behaviors complete and we can clear the stack,right. So in a programming language is single\r"
            },
            {
                "from": 525,
                "to": 530,
                "text": "threaded you're not using threads like sayRuby, that's what happens, right, we make\r"
            },
            {
                "from": 530,
                "to": 535,
                "text": "a network request, we have to just wait tillit's done, because we have no way of handling\r"
            },
            {
                "from": 536,
                "to": 543,
                "text": "that. Why is this actually a problem? Theproblem is because we're running code in browsers.\r"
            },
            {
                "from": 544,
                "to": 551,
                "text": "So, let's you ‑‑ here we go, okay. Sothis is just, this is Chrome, this is the\r"
            },
            {
                "from": 553,
                "to": 559,
                "text": "code I just ran. Browsers don't give us ‑‑well they do give us synchronous AJAX request,\r"
            },
            {
                "from": 559,
                "to": 563,
                "text": "I'm faking this out with a big while loop,because it's synchronous, I basically while\r"
            },
            {
                "from": 564,
                "to": 571,
                "text": "loop for five seconds before continuing, soif I open up the console here. We can see\r"
            },
            {
                "from": 574,
                "to": 580,
                "text": "what happens, so with request foo.com, whythis is happening, I can't do anything, right,\r"
            },
            {
                "from": 580,
                "to": 584,
                "text": "even the run button hasn't finished rerenderingthe fact that I clicked it. The browser is\r"
            },
            {
                "from": 585,
                "to": 591,
                "text": "blocked, it's stuck, it can't do anythinguntil those requests complete. And then all\r"
            },
            {
                "from": 591,
                "to": 595,
                "text": "hell breaks loose because I did some stuff,itfigured that out I'd done it, it couldn't\r"
            },
            {
                "from": 596,
                "to": 603,
                "text": "actually render it. Couldn't do anything.That's because if that call stack has things\r"
            },
            {
                "from": 603,
                "to": 609,
                "text": "on it, and here it's got these yeah, it'sstill going. We've got the synchronous request,\r"
            },
            {
                "from": 610,
                "to": 614,
                "text": "the browser can't do anything else. It can'trender, it can't run any other code, it's\r"
            },
            {
                "from": 615,
                "to": 619,
                "text": "stuck. Not ideal, right if we want peopleto have nice fluid UIs, we can't block the\r"
            },
            {
                "from": 620,
                "to": 627,
                "text": "stack. So, how do we handle this? Well thesimplest solution we're provided with is asynchronous\r"
            },
            {
                "from": 627,
                "to": 634,
                "text": "callbacks, there's almost no blocking functionsin the browser, equally in node, they're all\r"
            },
            {
                "from": 635,
                "to": 639,
                "text": "made asynchronous, which basically means werun some code, give it a callback, and run\r"
            },
            {
                "from": 640,
                "to": 645,
                "text": "that later, if you've seen JavaScript you'veseen asynchronous callbacks, what does this\r"
            },
            {
                "from": 645,
                "to": 652,
                "text": "actually look like. Simple example to remindpeople where we're at. Code like this, console.log\r"
            },
            {
                "from": 652,
                "to": 659,
                "text": "hi. Write, we run the setTimeout, but thatqueue's the console log for future so we skip\r"
            },
            {
                "from": 660,
                "to": 667,
                "text": "on to JSConf and then five seconds later welog \"there\" right, make sense? Happy. Basically\r"
            },
            {
                "from": 667,
                "to": 672,
                "text": "that's setTimeout is doing something. So,asynchronous callbacks with regards to the\r"
            },
            {
                "from": 673,
                "to": 680,
                "text": "stacks we saw before ... how does this work?Let's run the code. Console.log hi. setTimeout.\r"
            },
            {
                "from": 682,
                "to": 687,
                "text": "We know it doesn't run immediately, we knowit's going to run in five seconds time, we\r"
            },
            {
                "from": 688,
                "to": 693,
                "text": "can't push it on to the stack, somehow itjust disappears, we don't have like a way\r"
            },
            {
                "from": 694,
                "to": 701,
                "text": "of describing this yet, but we'll come toit. We log JSConfEU, clear, five seconds later\r"
            },
            {
                "from": 701,
                "to": 708,
                "text": "somehow magically \"there\" appears on the stack.How does that happen? And that's ‑‑ this\r"
            },
            {
                "from": 709,
                "to": 715,
                "text": "is basically where the event loop comes inon concurrency. Right, so I've been kind of\r"
            },
            {
                "from": 716,
                "to": 719,
                "text": "partially lying do you and telling you thatJavaScript can only do one thing at one time.\r"
            },
            {
                "from": 720,
                "to": 724,
                "text": "That's true the JavaScript Runtime can onlydo one thing at one time. It can't make an\r"
            },
            {
                "from": 724,
                "to": 728,
                "text": "AJAX request while you're doing other code.It can't do a setTimeout while you're doing\r"
            },
            {
                "from": 728,
                "to": 732,
                "text": "another code. The reason we can do thingsconcurrently is that the browser is more than\r"
            },
            {
                "from": 733,
                "to": 738,
                "text": "just the Runtime. So, remember this diagram,the JavaScript Runtime can do one thing at\r"
            },
            {
                "from": 738,
                "to": 742,
                "text": "a time, but the browser gives us these otherthings, gives us these we shall APIs, these\r"
            },
            {
                "from": 742,
                "to": 749,
                "text": "are effectively threads, you can just makecalls to, and those pieces of the browser\r"
            },
            {
                "from": 749,
                "to": 754,
                "text": "are aware of this concurrency kicks in. Ifyou're back end person this diagram looks\r"
            },
            {
                "from": 755,
                "to": 762,
                "text": "basically identical for node, instead of webAPIs we have C++ APIs and the threading is\r"
            },
            {
                "from": 762,
                "to": 769,
                "text": "being hidden from you by C++. Now we havethis picture let's see how this code runs\r"
            },
            {
                "from": 771,
                "to": 777,
                "text": "in a more full picture of what a browser lookslike. So, same as before, run code, console\r"
            },
            {
                "from": 777,
                "to": 784,
                "text": "log hi, logs hi to the console, simple. nowwe can see what happens when we call setTimeout.\r"
            },
            {
                "from": 785,
                "to": 792,
                "text": "We are ‑‑ we pass this callback functionand a delay to the setTimeout call. Now setTimeout\r"
            },
            {
                "from": 792,
                "to": 797,
                "text": "is an API provided to us by the browser, itdoesn't live in the V8 source, it's extra\r"
            },
            {
                "from": 797,
                "to": 801,
                "text": "stuff weget in that we're running the JavaScript run\r"
            },
            {
                "from": 802,
                "to": 808,
                "text": "time in. The browser kicks off a timer foryou. And now it's going to handle the count\r"
            },
            {
                "from": 809,
                "to": 814,
                "text": "down for you, right, so that means our setTimeoutcall, itself is now complete, so we can pop\r"
            },
            {
                "from": 815,
                "to": 822,
                "text": "off the stack. “JSConfEU”, clear, so,now we've got this timer in the web API, which\r"
            },
            {
                "from": 824,
                "to": 830,
                "text": "five seconds later is going to complete. Nowthe web API can't just start modifying your\r"
            },
            {
                "from": 830,
                "to": 834,
                "text": "code, it can't chuck stuff onto the stackwhen it's ready if it did it would appear\r"
            },
            {
                "from": 835,
                "to": 839,
                "text": "randomly in the middle of your code so thisis where the task queue or callback queue\r"
            },
            {
                "from": 840,
                "to": 847,
                "text": "kicks in. Any of the web APIs pushes the callbackon to the task queue when it's done. Finally\r"
            },
            {
                "from": 848,
                "to": 853,
                "text": "we get to the event loop, title of the talk,what the heck is the event loop is like the\r"
            },
            {
                "from": 853,
                "to": 858,
                "text": "simplest little piece in this whole equation,and it has one very simple job.\r"
            },
            {
                "from": 859,
                "to": 863,
                "text": "The event loops job is to look at the stackand look at the task queue. If the stack is\r"
            },
            {
                "from": 863,
                "to": 867,
                "text": "empty it takes the first thing on the queueand pushes it on to the stack which effectively\r"
            },
            {
                "from": 867,
                "to": 873,
                "text": "run it. So here we can see that now the stackis clear, there's a callback on the task queue,\r"
            },
            {
                "from": 874,
                "to": 879,
                "text": "the event loop runs, it says, oh, I get todo something, pushes the callback on to the\r"
            },
            {
                "from": 879,
                "to": 884,
                "text": "stack. Remember it's the stack is like JavaScriptland, back inside V8, the callback appears\r"
            },
            {
                "from": 885,
                "to": 892,
                "text": "on the stack, run, console.log “there”,and we're done. Does that make sense? Everyone\r"
            },
            {
                "from": 892,
                "to": 899,
                "text": "where me? Awesome! Okay. So, now we can seehow this works with probably one of the first\r"
            },
            {
                "from": 899,
                "to": 903,
                "text": "encounters you would have had with Async stuffwhich for some weird reason someone says says\r"
            },
            {
                "from": 904,
                "to": 910,
                "text": "you have to call setTimeout zero, ‑‑okay, you want me to run the function in zero\r"
            },
            {
                "from": 911,
                "to": 914,
                "text": "time? Why would I wrap it in a setTimeout?Like the first time you run across this, if\r"
            },
            {
                "from": 914,
                "to": 921,
                "text": "you're like me,i see it doing something, butI don't know why. The reason is, generally,\r"
            },
            {
                "from": 921,
                "to": 925,
                "text": "if you're trying to defer something untilthe stack is clear. So we know looking at\r"
            },
            {
                "from": 926,
                "to": 929,
                "text": "this, if you've written JavaScript, that we'regoing to see the same result, we're going\r"
            },
            {
                "from": 929,
                "to": 935,
                "text": "to see “hi” “JSConf”, and “there”is going to appear at the end. We can see\r"
            },
            {
                "from": 936,
                "to": 941,
                "text": "how that happens. The setTimeout zero, nowit's going to complete immediately and push\r"
            },
            {
                "from": 941,
                "to": 945,
                "text": "it on to the queue, remember what I said aboutthe event loop, it has to wait till the stack\r"
            },
            {
                "from": 946,
                "to": 951,
                "text": "is clear before it can push the callback onto the stack, so your stack is going to continue\r"
            },
            {
                "from": 951,
                "to": 958,
                "text": "to run, console.log “hi”, “JSConfEU”and clear, now the event loop can kick in\r"
            },
            {
                "from": 958,
                "to": 965,
                "text": "and call your callback. That's like an exampleof setTimeout zero, is deferring that execution\r"
            },
            {
                "from": 966,
                "to": 973,
                "text": "of code, for whatever reason to the end ofthe stack. Or until stack is clear. Okay.\r"
            },
            {
                "from": 974,
                "to": 980,
                "text": "So, all these web APIs work the same way,if we have AJAX request, we make an AJAX request\r"
            },
            {
                "from": 981,
                "to": 988,
                "text": "to the URL with a callback, works the sameway, oops sorry, console log, “hi”, make\r"
            },
            {
                "from": 988,
                "to": 992,
                "text": "an AJAX request, the code for running thatAJAX request does not live in JavaScript Runtime\r"
            },
            {
                "from": 992,
                "to": 999,
                "text": "but in the browser as a web API, so we spinit up with a callback in the URL, your code\r"
            },
            {
                "from": 1000,
                "to": 1005,
                "text": "can continue to run. Until that XHR requestcompletes, or it may never complete, it's\r"
            },
            {
                "from": 1005,
                "to": 1010,
                "text": "okay, the stack can continue to run, assumingit completes, gets pushed to the queue,picked\r"
            },
            {
                "from": 1011,
                "to": 1018,
                "text": "up by the event loop and it's run. That'sall that happens when an Async call happens.\r"
            },
            {
                "from": 1018,
                "to": 1025,
                "text": "Let's do a crazy complicated example, I hopethis going to work, if you haven't realized\r"
            },
            {
                "from": 1025,
                "to": 1031,
                "text": "all this is in keynote there's like I don'tknow 500 animation steps in this whole deck.\r"
            },
            {
                "from": 1032,
                "to": 1039,
                "text": "(code blows up, flames animation) (Applause)J Whew ... no ... so ... interesting, we're\r"
            },
            {
                "from": 1055,
                "to": 1062,
                "text": "given a link. Hmm ... is this big enough,can people see? Okay, so basically I wrote\r"
            },
            {
                "from": 1064,
                "to": 1071,
                "text": "this talk for Scotland JS, after the talkI broke half of the slides and could not be\r"
            },
            {
                "from": 1072,
                "to": 1076,
                "text": "bothered to redo all the slides because itwas a total pain in the ass in keynote to\r"
            },
            {
                "from": 1077,
                "to": 1084,
                "text": "do it so I took much easier route (Laughing)of writing a tool that can visualize the JavaScript\r"
            },
            {
                "from": 1086,
                "to": 1093,
                "text": "Runtime at Runtime, and it's called loop.So, let's just run this example and, which\r"
            },
            {
                "from": 1095,
                "to": 1100,
                "text": "was kind of the example that we had on theprevious slide, I haven't shimmed XHR yet,\r"
            },
            {
                "from": 1100,
                "to": 1105,
                "text": "it's doable I just haven't done it. As youcan see the code, we're going to log something,\r"
            },
            {
                "from": 1105,
                "to": 1112,
                "text": "this is a shim around addEventListener, setTimeoutand we're going to do a console.log. ‑‑\r"
            },
            {
                "from": 1113,
                "to": 1119,
                "text": "I'm going to run it and see what happens so... add a DOM API, add a timeout, code is\r"
            },
            {
                "from": 1120,
                "to": 1127,
                "text": "going to continue to run, pushes the callbackinto the queue which runs, and we're done.\r"
            },
            {
                "from": 1129,
                "to": 1134,
                "text": "If I click on here then it's going to ... triggerthe web API, queue the callback for the click\r"
            },
            {
                "from": 1134,
                "to": 1140,
                "text": "and run it. if I cluck a hundred times wecan see what happens. I clicked, the click\r"
            },
            {
                "from": 1141,
                "to": 1145,
                "text": "doesn't get processed immediately, itselfgets pushed to the queue, as the queue gets\r"
            },
            {
                "from": 1146,
                "to": 1152,
                "text": "processed, eventually my click is going toget dealt with, right. So I have a few more\r"
            },
            {
                "from": 1152,
                "to": 1159,
                "text": "examples I'm going to run through here. Herewe go, okay, so, I'm just going to run through\r"
            },
            {
                "from": 1164,
                "to": 1170,
                "text": "a few examples just to kind of talk abouta few things that you might have run in to\r"
            },
            {
                "from": 1171,
                "to": 1177,
                "text": "and not thought about with Async APIs, Inthis example we call setTimeout four times\r"
            },
            {
                "from": 1177,
                "to": 1184,
                "text": "with the one second delay, and console.log“hi”. By the time the callbacks get queued...\r"
            },
            {
                "from": 1189,
                "to": 1193,
                "text": "that fourth callback we asked for a one seconddelay, and it's still waiting, the callback\r"
            },
            {
                "from": 1194,
                "to": 1196,
                "text": "hasn't run, right .\r\r"
            },
            {
                "from": 1196,
                "to": 1201,
                "text": "this illustrates the ‑‑ like what timeout is actually doing, it's not a guaranteed\r"
            },
            {
                "from": 1202,
                "to": 1206,
                "text": "time to execution, it's a minimum time toexecution, just like setTimeout zero doesn't\r"
            },
            {
                "from": 1206,
                "to": 1213,
                "text": "run the code immediately it runs the codenext‑ish, sometime, right? So ... in this\r"
            },
            {
                "from": 1217,
                "to": 1224,
                "text": "example I want to talk about callbacks, so,depending on who, speak to and how they phrase\r"
            },
            {
                "from": 1225,
                "to": 1229,
                "text": "things, callbacks can be one of two things,callbacks can be any function that another\r"
            },
            {
                "from": 1230,
                "to": 1235,
                "text": "function calls or callbacks can be more explicitlyan asynchronous callback as in one that will\r"
            },
            {
                "from": 1235,
                "to": 1240,
                "text": "get pushed back on the callback queue in thefuture. This bit of code illustrates the difference,\r"
            },
            {
                "from": 1241,
                "to": 1248,
                "text": "right. The forEach method on an array, itdoesn't run, it takes a function, which you\r"
            },
            {
                "from": 1248,
                "to": 1252,
                "text": "could call a callback, but it's not runningit asynchronously, it's running it within\r"
            },
            {
                "from": 1252,
                "to": 1259,
                "text": "the current stack. We could define an asynchronousforEach so it can take an array, a callback\r"
            },
            {
                "from": 1261,
                "to": 1266,
                "text": "and for each item in the array it's goingto do a setTimeout zero with that callback,\r"
            },
            {
                "from": 1267,
                "to": 1272,
                "text": "I guess this should pass in the value, butany way, so, I'm going to run it and we can\r"
            },
            {
                "from": 1273,
                "to": 1278,
                "text": "see what the difference is, so for the firstblock of code that runs, it's going to sit\r"
            },
            {
                "from": 1278,
                "to": 1285,
                "text": "and block the stack, right? Until it's complete,whereas in the Async version, okay, it's slowed\r"
            },
            {
                "from": 1285,
                "to": 1290,
                "text": "down, but we're basically going to queue abunch of callbacks and they're going to clear\r"
            },
            {
                "from": 1291,
                "to": 1296,
                "text": "and then we can actually run through and doa console.log. In this example the console.log\r"
            },
            {
                "from": 1296,
                "to": 1301,
                "text": "is fast, so the benefit of doing it asynchronouslyis not obviously but let's say you're doing\r"
            },
            {
                "from": 1301,
                "to": 1308,
                "text": "some slow processing on each element in thearray. I think I have that shown somewhere\r"
            },
            {
                "from": 1312,
                "to": 1319,
                "text": "no, no, I don't. Okay. So let's say ‑‑Ooops. So I have a delay function which is\r"
            },
            {
                "from": 1321,
                "to": 1328,
                "text": "just slow, it's just a slow thing. So ... let'ssay processing Async and here processing Sync.\r"
            },
            {
                "from": 1335,
                "to": 1342,
                "text": "Okay, now, I'm going to turn on a thing I'veliterally hacked together this morning, which\r"
            },
            {
                "from": 1343,
                "to": 1347,
                "text": "is to simulate the repaint or the render inthe browser, something I haven't touched on\r"
            },
            {
                "from": 1347,
                "to": 1353,
                "text": "is how all of this interacts with rendering ‑‑I've kind of touched on it but not really\r"
            },
            {
                "from": 1354,
                "to": 1361,
                "text": "explained it. So, basically the browser iskind of constrained by what you're doing javaScript,\r"
            },
            {
                "from": 1361,
                "to": 1366,
                "text": "the browser would like to repaint the screenevery 16.6 milliseconds, 60 frame a second\r"
            },
            {
                "from": 1367,
                "to": 1373,
                "text": "is ideal, that's the fastest it will do repaintsif it can. But it's constrained by what you're\r"
            },
            {
                "from": 1373,
                "to": 1378,
                "text": "doing in JavaScript for various reasons, soit can't actually do a render if there is\r"
            },
            {
                "from": 1379,
                "to": 1384,
                "text": "code on the stack, right. Like the renderkind of call is almost like a callback in\r"
            },
            {
                "from": 1384,
                "to": 1389,
                "text": "itself. It has to wait till the stack is clear.The difference is that the render is given\r"
            },
            {
                "from": 1390,
                "to": 1397,
                "text": "a higher priority than your callback, every16 milliseconds it's going to queue a rend,\r"
            },
            {
                "from": 1398,
                "to": 1404,
                "text": "wait till the stack is clear before it canactually do that render. So this is ‑‑\r"
            },
            {
                "from": 1404,
                "to": 1408,
                "text": "this render queue is just simulating a render,every second it's can I do a render? Yes,\r"
            },
            {
                "from": 1408,
                "to": 1412,
                "text": "can I do a render? Yes. Where, because ourcode isn't doing anything now. If I run the\r"
            },
            {
                "from": 1413,
                "to": 1420,
                "text": "code, you can see while we're doing this slowsynchronous loop through the array, our render\r"
            },
            {
                "from": 1420,
                "to": 1425,
                "text": "is blocked, right, if our render is blockedyou can't select text on the screen, you can't\r"
            },
            {
                "from": 1425,
                "to": 1430,
                "text": "click things and see the response, right,like the example I showed earlier. In this\r"
            },
            {
                "from": 1431,
                "to": 1438,
                "text": "example, okay, it's blocked while we queueup the async time out, that relatively quick\r"
            },
            {
                "from": 1440,
                "to": 1444,
                "text": "but we're given ‑‑ we're kind of givingthe render a chance between each element because\r"
            },
            {
                "from": 1444,
                "to": 1451,
                "text": "we've queued it up asynchronously to jumpin there and do the render, does that make\r"
            },
            {
                "from": 1453,
                "to": 1453,
                "text": "sense?\r\r"
            },
            {
                "from": 1453,
                "to": 1455,
                "text": ">> Yeah>> Yeah, cool. So, that's just kind of ‑‑\r"
            },
            {
                "from": 1455,
                "to": 1459,
                "text": "this is just like a simulation of how therendering works, but it just really shows\r"
            },
            {
                "from": 1460,
                "to": 1463,
                "text": "you when people say don't block the eventloop, this is exactly what they're talking\r"
            },
            {
                "from": 1464,
                "to": 1467,
                "text": "about. They're saying don't put shitty slowcode on the stack because when you do that\r"
            },
            {
                "from": 1467,
                "to": 1473,
                "text": "the browser can't do what it needs to do,create a nice fluid UI. This is why when you're\r"
            },
            {
                "from": 1473,
                "to": 1479,
                "text": "doing things like image processing or Animatingtoo many things gets sluggish if you're not\r"
            },
            {
                "from": 1479,
                "to": 1486,
                "text": "careful about how you queue up that code.So an example of that, we can see with the\r"
            },
            {
                "from": 1488,
                "to": 1495,
                "text": "scroll handlers ‑‑ so scroll handle ‑‑like scroll events in the DOM trigger a lot,\r"
            },
            {
                "from": 1496,
                "to": 1501,
                "text": "right, they trigger like ‑‑ I presumethey trigger on every frame like every 16\r"
            },
            {
                "from": 1501,
                "to": 1507,
                "text": "milliseconds, if I have code like this thisright. On document.scroll, animate something,\r"
            },
            {
                "from": 1508,
                "to": 1515,
                "text": "or do some work. If I have this code, likeas I scroll it's going to queue up like a\r"
            },
            {
                "from": 1515,
                "to": 1520,
                "text": "ton of callbacks right. And then it has togo through and process all of those and each\r"
            },
            {
                "from": 1520,
                "to": 1525,
                "text": "of the processing of those is slow, then,okay, you're not blocking the stack, you're\r"
            },
            {
                "from": 1526,
                "to": 1533,
                "text": "flooding the queue with queued events. So,this is like just helping visualize, I guess,\r"
            },
            {
                "from": 1534,
                "to": 1538,
                "text": "what happens when you actually trigger allthese callbacks, there's way you can debounce\r"
            },
            {
                "from": 1538,
                "to": 1544,
                "text": "that to basically say okay, we're going toqueue up all those events, but let's do the\r"
            },
            {
                "from": 1544,
                "to": 1551,
                "text": "slow work every few seconds or until the userstops scrolling for some amount of time I\r"
            },
            {
                "from": 1554,
                "to": 1561,
                "text": "think that's basically it. There's a wholeother talk in how the hell this works. Because\r"
            },
            {
                "from": 1563,
                "to": 1569,
                "text": "basically in running the code, like this coderuns at Runtime, right, and it's slowed down\r"
            },
            {
                "from": 1569,
                "to": 1576,
                "text": "by I run it through a Esprima a JavaScriptparser, I insert a big while loop, that takes\r"
            },
            {
                "from": 1578,
                "to": 1585,
                "text": "half a second, it just slow motions the code.Ship it to web worker and do a whole bunch\r"
            },
            {
                "from": 1585,
                "to": 1591,
                "text": "of stuff to visualize what's happening whiledoing it at run time that makes sense. A whole\r"
            },
            {
                "from": 1591,
                "to": 1597,
                "text": "other talk in that. I'm super excited aboutit and will talk to anyone about it after\r"
            },
            {
                "from": 1598,
                "to": 1603,
                "text": "because I think it's kind of neat, so withthat, thanks very much ( applause)\r"
            }
        ]
    }
]